{
  "backend/main.mo": "Defines the backend actor for tournaments, teams, players, matches, innings, and scoring, with authorization integration and in‑memory maps for all entities.",
  "feature_evidence.json": "Lists implemented features with associated files, components, and test references for authentication, UI shell, theming, and tournament management.",
  "frontend-file-summaries.txt": "Contains prewritten 1–2 sentence summaries for all major frontend files including pages, components, hooks, and layout.",
  "frontend/index.css": "Defines global Tailwind layers and a green-themed OKLCH design system for light and dark modes.",
  "frontend/index.html": "Basic HTML entrypoint loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and wraps the app with ThemeProvider, TournamentProvider, and AppShell.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with loading state and query cache clearing.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal prompting new authenticated users to enter a name and save their profile.",
  "frontend/src/components/scoring/LiveScoringPanel.tsx": "UI panel for selecting players and recording ball-by-ball scoring events using addBall mutations.",
  "frontend/src/components/tournaments/TournamentSwitcher.tsx": "Dropdown and dialog for selecting or creating tournaments, auto-selecting the first available option.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to identity, invalidating related queries when it changes.",
  "frontend/src/hooks/useCurrentUser.ts": "Provides authenticated user state and profile info from Internet Identity and backend queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider managing Internet Identity login state, stored identities, and auth client setup.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks wrapping actor API calls for tournaments, teams, players, and mutations with cache invalidation.",
  "frontend/src/index.css": "Tailwind base styles plus cricket-themed color variables for light and dark modes.",
  "frontend/src/layout/AppShell.tsx": "Main layout with sidebar, mobile navigation, login button, and optional profile setup dialog.",
  "frontend/src/layout/SidebarNav.tsx": "Sidebar navigation with logo, tournament switcher, nav links, and login/footer elements.",
  "frontend/src/main.tsx": "App entry point initializing React, query client, and Internet Identity provider.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard showing match, team, and player stats plus a recent matches list.",
  "frontend/src/pages/LiveScoringPage.tsx": "Live scoring view that loads match data, validates state, and renders the scoring panel.",
  "frontend/src/pages/MatchesPage.tsx": "Matches list with creation dialog, filtering by tournament, and links to scoring pages.",
  "frontend/src/pages/MatchReportPage.tsx": "Match report page displaying placeholder summary and team details pending backend support.",
  "frontend/src/pages/PlayerDetailPage.tsx": "Player detail page showing basic player info and placeholder batting/bowling stats.",
  "frontend/src/pages/PlayersPage.tsx": "Players management page that lists players and allows authenticated users to create new ones with optional team assignment.",
  "frontend/src/pages/ReportsPage.tsx": "Displays completed match reports for the active tournament or prompts the user if none exist.",
  "frontend/src/pages/ScoreboardPage.tsx": "Shows basic match metadata and placeholder scoreboard info for a selected match.",
  "frontend/src/pages/TeamDetailPage.tsx": "Shows details and roster for a specific team, with captain indicators and a note about pending backend features.",
  "frontend/src/pages/TeamsPage.tsx": "Lists teams for the active tournament and allows authenticated users to create new teams.",
  "frontend/src/state/TournamentContext.tsx": "Provides context for managing and persisting the active tournament ID in localStorage.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL and session parameters for routing and persistence.",
  "frontend/tailwind.config.js": "Tailwind configuration defining dark mode, content paths, custom colors, typography, animations, and plugin usage for the frontend UI theme.",
  "project_state.json": "Project metadata describing the SaaS cricket app’s scope, architecture notes, required images, and a list of implemented features with versioning."
}